app/Models/ModelUser.php

    public function getUser()
    {
        $builder = $this->db->table('tbl_user');
       return $builder->get();
---
SELECT *
FROM `tbl_user`

    public function cek_login($username)
    {
       return $this->db->table('tbl_user')->Where(array('nama_user'=> $username))->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `nama_user` = 'CYNTIA'