app/Models/ModelPenjualan.php

    public function getLaporanPenjualan()
    {
        $builder = $this->db->table('tbl_pesanan');
        return $builder->get();
---
SELECT *
FROM `tbl_pesanan`